import random
import json

videos = [
    {
        "id": "1",
        "name": "Filling Stepmoms Pot Of Gold - Cherry Kiss",
        "url": "https://cdn-aws-exp.cdnamz.me/playlists/2f4fb285-9d79-495e-ac46-9d414cf65a4c/u8lmahqjne.m3u8",
        "thumbnail": "https://siska.video/category/MILF/871684964.jpg",
        "description": "Cherry Kiss is making shamrock milkshakes for St. Patrick's Day when her stepson Parker Ambrose asks what she's up to. Cherry tells him he has to put on some green or she's going to start pinching him. When Parker returns, Cherry gives him the milkshake complete with whipped cream on top. Then she walks up to Parker and tells him she wants to taste his cream. Parker isn't about to say no to such a sexy offer. He pins Cherry against the kitchen island and slams into her from behind. Cherry lifts a leg, giving Parker better access to her cooch and making it easy to rub her own clit. Then she drops to a crouch so she can enjoy a deep throat BJ and some serious ball sucking.Urging her stepson onto his back, Cherry climbs on top of him and sinks down for a stiffie ride. She climbs onto the counter and turns onto her side so Parker can shove back home. Then Cherry rolls onto her back so her stepson can make her cum one last time. When Parker pulls out, Cherry holds up a milkshake for him to cum on so she can enjoy her treat topped with her stepson's cream",
        "suggestions": []
    },
    {
        "id": "2",
        "name": "Busty Milf Sucks Her Stepson's Dick for a Job Referral- Bambi Blitz",
        "url": "https://cdn-aws-exp.cdnamz.me/playlists/c92c7e3f-e4cf-4161-8f67-6b0f0235481e/u8lmahqjne.m3u8",
        "thumbnail": "https://yespornpleasexxx.com/wp-content/uploads/2025/03/Bambi-Blitz-Busty-Milf-Sucks-Her-Stepsons-Dick-for-a-Job-Referral.jpeg",
        "description": "I knew my stepmom was desperate for a job, but I didn’t realize how much. When she saw how much I made at the coffee shop, she practically begged me for a referral. The only chicks I've ever referred have been my girlfriends, so I told her I only recommend people who suck my dick. When I said that, I was not expecting her to do it, but she did, and it was the best blowjob I've ever had. How could I say no to that? Especially when she let me fuck her gigantic tits and swallowed my cum. I'm so glad I recommended her for the job because things got even better when she wanted to thank me.",
        "suggestions": []
    },
    {
        "id": "3",
        "name": "Brazzers / - Angela White, Roxie Sinner, Mick Blue Cheating With The Horny Hosts / 8.2.2024",
        "url": "https://cdn-aws-t11.cdnamz.me/playlists/756977a2-e6d7-4805-9153-5a42b6a66458/u8lmahqjne.m3u8",
        "thumbnail": "https://media-public-ht.project1content.com/m=eaSaaTbWx/237/caf/7d3/e3e/4be/3be/72c/964/934/4e7/ce/poster/poster_01.jpg",
        "description": "The voluptuous Angela White and her man Mick Blue are horny swingers who rent out their home to couples on holiday, hosting Roxie Sinner and her new fiancé. While Roxie’s fiancé talks a big game when it comes to sex, he’s not willing to give his wife-to-be the rough, intense fuck she craves. When the swingers spy on the couple fighting over his refusal to engage in rough sex, they swoop in and treat Roxie to the sex she desperately desires, making her their submissive and dominating her during a wild and sneaky threesome!",
        "suggestions": []
    },
    {
        "id": "4",
        "name": "Pervmom Erin Everheart Go All the Way Blindfolded Bound Thirsty for Cum",
        "url": "https://cdn-aws-exp.cdnamz.me/playlists/205f0979-f385-4c63-8458-9b72b35f6431/u8lmahqjne.m3u8",
        "thumbnail": "https://mypervmom.com/wp-content/uploads/2025/02/erin_everheart-480x270.jpg",
        "description": "Erin was growing tired of the same old vanilla sex her husband gave her every week, so she decided to take things to a whole new level and do something she’d always fantasized about but never dared to attempt. She published an online ad inviting all strangers to come to her house and use her as they pleased. She tied herself to the bed, waiting for her first master to show up, and right away she could tell who it was… she recognized her stepson’s smell and energy because she’s been dreaming of this moment for years. After swallowing his cum like a good little slut, Erin knew he’d be back, but sensing he didn’t dare to cross the ultimate line, she confronted him and gave him permission do it: fuck your stepmommy, let me ride you, and please, cum in my mouth again.",
        "suggestions": []
    }
]

def randomize_suggestions(videos):
    ids = [video["id"] for video in videos]
    for video in videos:
        suggestions = [id for id in ids if id != video["id"]]
        random.shuffle(suggestions)
        video["suggestions"] = suggestions[:4]
    return videos

randomized_videos = randomize_suggestions(videos)

# Save the randomized videos to a JSON file
with open('randomized_videos.json', 'w') as f:
    json.dump(randomized_videos, f, indent=2)

# Print the randomized videos
for video in randomized_videos:
    print(video)
